Tekla Open API Reference for Tekla Structures 2025
View.ViewProjectionType Enumeration
 The view projection types. The projection type can be read but not changed.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ViewProjectionType
Public Enumeration ViewProjectionType
Members
Member name | Value | Description
ORTHOGONAL_PROJECTION | 0 |  The orthogonal view projection type.
PERSPECTIVE_PROJECTION | 1 |  The perspective view projection type.
See Also
Reference
Tekla.Structures.Model.UI Namespace